## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/9995656487)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 17 to change, 2 to destroy.</code></pre>

* Update
  * google_service_account.sa_gke_kyma_integration
  * google_service_account.secrets-rotator
  * module.github_webhook_gateway.google_service_account.github_webhook_gateway
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_service_account.github_issue_creator
  * module.secrets_leaks_log_scanner.google_service_account.github_issue_finder
  * module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector
  * module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
  * module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner
  * module.service_account_keys_rotator.google_service_account.service_account_keys_rotator
  * module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender
  * module.slack_message_sender.google_service_account.slack_message_sender
* Replace
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_service_account.sa_gke_kyma_integration will be updated in-place
  ~ resource "google_service_account" "sa_gke_kyma_integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow" -> "Service account is used by Prow to integrate with GKE."
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # google_service_account.secrets-rotator will be updated in-place
  ~ resource "google_service_account" "secrets-rotator" {
      - description  = "Identity of the secrets rotator application" -> null
      ~ display_name = "secrets-rotator" -> "Identity of the secrets rotator application"
        id           = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (6 unchanged attributes hidden)
    }

  # module.github_webhook_gateway.google_service_account.github_webhook_gateway will be updated in-place
  ~ resource "google_service_account" "github_webhook_gateway" {
      - display_name = "github-webhook-gateway" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.secrets_leaks_log_scanner.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret" "gh_tools_kyma_bot_token" {
      + annotations           = (known after apply)
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + replication           = (known after apply)
      + rotation              = (known after apply)
      + secret_id             = "trusted_default_kyma-bot-github-sap-token"
      + terraform_labels      = (known after apply)
      + topics                = (known after apply)
      + ttl                   = (known after apply)
      + version_aliases       = (known after apply)
      + version_destroy_ttl   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_bucket" "kyma_prow_logs" {
      + autoclass                   = (known after apply)
      + cors                        = (known after apply)
      + custom_placement_config     = (known after apply)
      + default_event_based_hold    = (known after apply)
      + effective_labels            = (known after apply)
      + enable_object_retention     = (known after apply)
      + encryption                  = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + lifecycle_rule              = (known after apply)
      + location                    = (known after apply)
      + logging                     = (known after apply)
      + name                        = "kyma-prow-logs"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + requester_pays              = (known after apply)
      + retention_policy            = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + soft_delete_policy          = (known after apply)
      + storage_class               = (known after apply)
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + versioning                  = (known after apply)
      + website                     = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer must be replaced
-/+ resource "google_project_iam_member" "project_log_writer" {
      ~ etag    = "BwYajaX6goE=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker must be replaced
-/+ resource "google_project_iam_member" "project_workflows_invoker" {
      ~ etag    = "BwYajaX6goE=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover will be updated in-place
  ~ resource "google_service_account" "gcs_bucket_mover" {
      - display_name = "gcs-bucket-mover" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.github_issue_creator will be updated in-place
  ~ resource "google_service_account" "github_issue_creator" {
      - display_name = "github-issue-creator" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.github_issue_finder will be updated in-place
  ~ resource "google_service_account" "github_issue_finder" {
      - display_name = "github-issue-finder" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector will be updated in-place
  ~ resource "google_service_account" "secrets_leak_detector" {
      - display_name = "secrets-leak-detector" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_service_account" "secrets_leak_log_scanner" {
      - display_name = "secrets-leak-log-scanner" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner will be updated in-place
  ~ resource "google_service_account" "service_account_keys_cleaner" {
      - display_name = "sa-keys-cleaner" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_rotator.google_service_account.service_account_keys_rotator will be updated in-place
  ~ resource "google_service_account" "service_account_keys_rotator" {
      - display_name = "sa-keys-rotator" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.slack_message_sender.data.google_iam_policy.run_invoker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com",
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "slack_message_sender" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/slack-message-sender"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.slack_message_sender.google_service_account.slack_message_sender will be updated in-place
  ~ resource "google_service_account" "slack_message_sender" {
      - display_name = "slack-message-sender" -> null
        id           = "projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 17 to change, 2 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-07-18T07:25:06.945738Z" -> "2024-07-18T14:59:10.801948Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
  ~ secrets-rotator                                     = {
      ~ description                  = "" -> null
        id                           = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name                         = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (9 unchanged attributes hidden)
    }
  ~ service_account_keys_cleaner                        = {
      ~ service_account_keys_cleaner_service_account   = {
          ~ display_name                 = "" -> null
            id                           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
            name                         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
            # (9 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  ~ service_account_keys_rotator                        = {
      ~ service_account_keys_rotator_service_account     = {
          ~ display_name                 = "" -> null
            id                           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            name                         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
            # (9 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # google_service_account.secrets-rotator has changed
  ~ resource "google_service_account" "secrets-rotator" {
      + description  = "Identity of the secrets rotator application"
      ~ display_name = "Identity of the secrets rotator application" -> "secrets-rotator"
        id           = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (6 unchanged attributes hidden)
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2024-07-18T07:25:06.945738Z" -> "2024-07-18T14:59:10.801948Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner has changed
  ~ resource "google_service_account" "service_account_keys_cleaner" {
      + display_name = "sa-keys-cleaner"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_rotator.google_service_account.service_account_keys_rotator has changed
  ~ resource "google_service_account" "service_account_keys_rotator" {
      + display_name = "sa-keys-rotator"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11385,"Program":"tfcmt","SHA1":"704bc6f9d41ec9c4892533854a4275a14eb178e7","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->